# CGHR-YOLOv8s — Full model for ablation D-I
# SPD-Conv backbone + CGHR Neck (P5 context only, P2/P3/P4 detection)
# VisDrone 10 classes

nc: 10

# Backbone — YOLOv8s scale with SPD-Conv stem
backbone:
  - [-1, 1, SPDConv, [32, 3]]         # 0: H/2, ch=32
  - [-1, 1, SPDConv, [64, 3]]         # 1: H/4, ch=64
  - [-1, 1, C2f, [64, True]]          # 2: stage2 P2 (H/4, 64ch)
  - [-1, 1, Conv, [128, 3, 2]]        # 3: H/8
  - [-1, 2, C2f, [128, True]]         # 4: stage3 P3 (H/8, 128ch)
  - [-1, 1, Conv, [256, 3, 2]]        # 5: H/16
  - [-1, 2, C2f, [256, True]]         # 6: stage4 P4 (H/16, 256ch)
  - [-1, 1, Conv, [512, 3, 2]]        # 7: H/32
  - [-1, 1, C2f, [512, True]]         # 8: stage5 P5 (H/32, 512ch)
  - [-1, 1, SPPF, [512, 5]]           # 9

# CGHR Neck — P5 context only, P2/P3/P4 detection
head:
  # P5 (9, H/32, 512ch) upsample -> fuse with P4 (6, H/16, 256ch)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10: P5 -> H/16
  - [[-1, 6], 1, Concat, [1]]                      # 11: cat(P5_up, P4)
  - [-1, 1, C2f, [256, False]]                    # 12: P4 fused (256ch)

  # P4 fused (12, H/16) upsample -> fuse with P3 (4, H/8, 128ch)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13: P4_fused -> H/8
  - [[-1, 4], 1, Concat, [1]]                      # 14: cat(P4_up, P3)
  - [-1, 1, C2f, [128, False]]                    # 15: P3 fused (128ch)

  # P4 fused (12, H/16) 4x upsample -> fuse with P2 (2, H/4, 64ch)
  - [12, 1, nn.Upsample, [None, 4, "nearest"]]   # 16: P4_fused -> H/4
  - [[-1, 2], 1, Concat, [1]]                      # 17: cat(P4_up4x, P2)
  - [-1, 1, C2f, [64, False]]                     # 18: P2 fused (64ch)

  # Detect: P2 (tiny), P3 (small), P4 (medium) — NO P5 head
  - [[18, 15, 12], 1, Detect, [nc]]               # 19
