# YOLOv8s + CBAM Attention (Course Project)
# depth_multiple and width_multiple MUST be specified for s-scale.
nc: 10
depth_multiple: 0.50
width_multiple: 0.50

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  # FPN: P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2f, [512, False]]
  - [-1, 1, CBAM, [256]]

  # FPN: P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2f, [256, False]]
  - [-1, 1, CBAM, [128]]

  # PAN: P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, C2f, [512, False]]
  - [-1, 1, CBAM, [256]]

  # PAN: P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C2f, [1024, False]]
  - [-1, 1, CBAM, [512]]

  - [[17, 21, 25], 1, Detect, [nc]]
