# YOLOv8s + SPD-Conv (Ablation B)
# SPD-Conv replaces first 2 stride-2 Conv in backbone.
# Standard PAN-FPN neck with P3/P4/P5 heads.

nc: 10

# depth_multiple: 0.50
# width_multiple: 0.50

backbone:
  # SPD-Conv stem: lossless downsampling instead of stride-2 Conv
  - [-1, 1, SPDConv, [32, 3]]         # 0: H/2, ch=32
  - [-1, 1, SPDConv, [64, 3]]         # 1: H/4, ch=64
  - [-1, 1, C2f, [64, True]]          # 2: C2f
  - [-1, 1, Conv, [128, 3, 2]]        # 3: H/8
  - [-1, 2, C2f, [128, True]]         # 4: C2f
  - [-1, 1, Conv, [256, 3, 2]]        # 5: H/16
  - [-1, 2, C2f, [256, True]]         # 6: C2f
  - [-1, 1, Conv, [512, 3, 2]]        # 7: H/32
  - [-1, 1, C2f, [512, True]]         # 8: C2f
  - [-1, 1, SPPF, [512, 5]]           # 9

# Standard YOLOv8 PAN-FPN head
head:
  # Upsample P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, Concat, [1]]                      # 11
  - [-1, 1, C2f, [256, False]]                    # 12: P4 fused

  # Upsample P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, Concat, [1]]                      # 14
  - [-1, 1, C2f, [128, False]]                    # 15: P3 fused

  # Downsample P3 -> P4 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                    # 17
  - [-1, 1, C2f, [256, False]]                    # 18: P4 PAN

  # Downsample P4 -> P5 (PAN)
  - [-1, 1, Conv, [512, 3, 2]]                    # 19
  - [[-1, 9], 1, Concat, [1]]                     # 20
  - [-1, 1, C2f, [512, False]]                    # 21: P5 PAN

  # Detect: P3, P4, P5
  - [[15, 18, 21], 1, Detect, [nc]]               # 22
